output/function-compose-type-cut.org
#+html_head: <link rel="stylesheet" href="../css/org-page.css"/>
#+title: function compose, type cut, and the algebra of logic

- author : XIE Yuheng, a math student
- date : 2016-06-14
- keywords : language design, dependent type, deduction system, sequent calculus, algebraic structure

* abstract

  - some said,
    [for example, see the wikipedia page of "Curry–Howard correspondence", at the time when this paper is written]
    in the framework of Curry–Howard correspondence,
    Gentzen's sequent calculus does not correspond with
    a well-defined pre-existing model of computation,
    as it was for Hilbert-style and natural deduction.

    - in this paper, I will show that
      we can get what sequent calculus corresponds to,
      not by designing a new model of computation,
      but by changing the syntax of well known model.

    - I will show that
      sequent calculus corresponds to a functional programming language,
      the syntax of which is optimized for function composition
      instead of function application.

    - I will also show the trade-off of this syntax design.
      1. the syntax of type and function-body are unified.
      2. we lose the implicit syntax for currying.
      3. we gain the algebraic associative law.

  - some also said, [for example, see the first chapter of "Homotopy Type Theory"]
    deduction system can be viewed as algebraic structure,
    where theorems are the elements (like elements of group),
    where deductive rules are the operations (like multiplication of group).

    - in this paper, I will show that
      with the associative law which we obtained from function composition,
      the corresponding deduction system of our programming language
      not merely "can be viewed as" algebraic structure,
      but actually has a very rich algebraic structure.

  - I will also introduce a prototype implementation of such a language.
    I call it "sequent1".

* background

*** how the idea was conceived

    - two years ago,
      for some reason, I learned the design of the stack-based language -- forth.
      I began to write my own forth-like language,
      and tried to add various features to it.
      soon I found another forth-like language -- joy.
      from joy I learned the composition v.s. application trade-off in syntax.

    - I added more and more features to my forth-like language.
      things went well, until I tried to add a type system to the it.
      I found that
      to design a good type system,
      a designer has to know Curry–Howard correspondence well.

    - and after some learning,
      I figured that
      the composition v.s. application trade-off in syntax,
      corresponds to
      the sequent-calculus v.s. natural-deduction in proof theory.

    - I tried to add such a sequent-calculus type system
      to the forth-like language several times.
      I failed.
      because the implementation is written in assembly language,
      the low-level detailed code would soon exceed the complexity
      that a normal people like me can manage.

    - I steped back.
      I decided to write a prototype language in scheme.
      the prototype only limited to demonstrate the main idea of "sequent-calculus as type system".
      thus I wrote "sequent1".

*** related works

    - there are many other works
      that assign computational models to sequent-calculus-like logics.
      for example :
      | people         | logic        | model                  |
      |----------------+--------------+------------------------|
      | Frank Pfenning | linear logic | concurrent programming |

    - maybe one logic system can correspond to multiple computational models.
      maybe more terminologys should be carefully coined,
      and more general framework theory should be wisely designed,
      to describe correspondences between deduction systems and computational models.

* the change of syntax

  - I will introduce my syntax by comparing it with
    the syntax of an imaginary agda-like (or idris-like) language.
    I will mark its syntax by << application-language >>,
    and I will mark my syntax by << composition-language >>.

