output/function-compose-type-cut.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-20 Wed 15:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>function compose, type cut, and the algebra of logic</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">function compose, type cut, and the algebra of logic</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2110d0f">abstract</a></li>
<li><a href="#org37167b0">background</a>
<ul>
<li><a href="#org97e4a0">how the idea was conceived</a></li>
<li><a href="#orgc4824e1">related works</a></li>
</ul>
</li>
<li><a href="#org2385a5c">the change of syntax</a>
<ul>
<li><a href="#org791f858">natural number</a></li>
<li><a href="#org759e2c0">detailed explanation of above example</a></li>
<li><a href="#org5cb770b">currying must also be explicit</a></li>
<li><a href="#orgb96c2b9">vector</a></li>
<li><a href="#orge3dae9e">unified syntax</a></li>
<li><a href="#orge3e7a49">different optimization of syntax</a>
<ul>
<li><a href="#orge2a3610">for function composition</a></li>
<li><a href="#org8320851">for function application</a></li>
</ul>
</li>
<li><a href="#org17542b2">stack processing</a></li>
</ul>
</li>
<li><a href="#org80b0ede">the correspondence</a>
<ul>
<li><a href="#orgb9685d1">type as theorem</a></li>
<li><a href="#org69411eb">function as proof</a>
<ul>
<li><a href="#org44e2096">cut</a></li>
<li><a href="#org83085ba">structural</a></li>
<li><a href="#org2096419">and</a></li>
<li><a href="#org5f3751">or</a></li>
<li><a href="#org98c857d">implies</a></li>
</ul>
</li>
<li><a href="#orgc9ef120">examples</a></li>
</ul>
</li>
<li><a href="#org2462815">algebra of logic</a>
<ul>
<li><a href="#org8cb2615">to mimic fraction of natural number</a></li>
<li><a href="#org112c49f">multiplication</a></li>
<li><a href="#org4dd4dee">two definitions of addition</a>
<ul>
<li><a href="#org206d8cb">first definition</a></li>
<li><a href="#org921523a">second definition</a></li>
</ul>
</li>
<li><a href="#orgf45d0a9">term-lattice, and cut as weaken</a></li>
<li><a href="#org89fce19">equality of theorem</a></li>
<li><a href="#orge34dcc1">constructiveness</a></li>
<li><a href="#orgbcf1259">algebraic extension</a></li>
</ul>
</li>
<li><a href="#orgb43053b">implementation</a>
<ul>
<li><a href="#orga89ab29">implementation-tech</a></li>
<li><a href="#orgdadcd03">mistakes in my implementation</a></li>
</ul>
</li>
<li><a href="#orgc600345">further work</a></li>
<li><a href="#org8702566">appendixes</a>
<ul>
<li><a href="#org8d82aca">rationale of using postfix notation</a></li>
<li><a href="#org41ffe51">remark on deduction and inference</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>author : XIE Yuheng, a math student</p></li>
<li><p>date : 2016-06-14</p></li>
<li><p>keywords : language design, dependent type, deduction system, sequent calculus, algebraic structure</p></li></ul>

<div id="outline-container-org2110d0f" class="outline-2">
<h2 id="org2110d0f">abstract</h2>
<div class="outline-text-2" id="text-org2110d0f">
<ul class="org-ul">
<li><p>some said,</p><p>[for example, see the wikipedia page of "Curry–Howard correspondence", at the time when this paper is written]</p><p>in the framework of Curry–Howard correspondence,</p><p>Gentzen's sequent calculus does not correspond with</p><p>a well-defined pre-existing model of computation,</p><p>as it was for Hilbert-style and natural deduction.</p><p></p><p><ul class="org-ul"></p><p><li><p>in this paper, I will show that</p><p>we can get what sequent calculus corresponds to,</p><p>not by designing a new model of computation,</p><p>but by changing the syntax of well known model.</p></li></p><p></p><p><li><p>I will show that</p><p>sequent calculus corresponds to a functional programming language,</p><p>the syntax of which is optimized for function composition</p><p>instead of function application.</p></li></p><p></p><p><li><p>I will also show the trade-off of this syntax design.</p><p><ol class="org-ol"></p><p><li>the syntax of type and function-body are unified.</li></p><p><li>we lose the implicit syntax for currying.</li></p><p><li>we gain the algebraic associative law.</li></ol></p></li></ul></p></li>

<li><p>some also said, [for example, see the first chapter of "Homotopy Type Theory"]</p><p>deduction system can be viewed as algebraic structure,</p><p>where theorems are the elements (like elements of group),</p><p>where deductive rules are the operations (like multiplication of group).</p><p></p><p><ul class="org-ul"></p><p><li><p>in this paper, I will show that</p><p>with the associative law which we obtained from function composition,</p><p>the corresponding deduction system of our programming language</p><p>not merely "can be viewed as" algebraic structure,</p><p>but actually has a very rich algebraic structure.</p></li></ul></p></li>

<li><p>I will also introduce a prototype implementation of such a language.</p><p>I call it "sequent1".</p></li></ul>
</div>
</div>

<div id="outline-container-org37167b0" class="outline-2">
<h2 id="org37167b0">background</h2>
<div class="outline-text-2" id="text-org37167b0">
</div><div id="outline-container-org97e4a0" class="outline-3">
<h3 id="org97e4a0">how the idea was conceived</h3>
<div class="outline-text-3" id="text-org97e4a0">
<ul class="org-ul">
<li><p>two years ago,</p><p>for some reason, I learned the design of the stack-based language &#x2013; forth.</p><p>I began to write my own forth-like language,</p><p>and tried to add various features to it.</p><p>soon I found another forth-like language &#x2013; joy.</p><p>from joy I learned the composition v.s. application trade-off in syntax.</p></li>

<li><p>I added more and more features to my forth-like language.</p><p>things went well, until I tried to add a type system to the it.</p><p>I found that</p><p>to design a good type system,</p><p>a designer has to know Curry–Howard correspondence well.</p></li>

<li><p>and after some learning,</p><p>I figured that</p><p>the composition v.s. application trade-off in syntax,</p><p>corresponds to</p><p>the sequent-calculus v.s. natural-deduction in proof theory.</p></li>

<li><p>I tried to add such a sequent-calculus type system</p><p>to the forth-like language several times.</p><p>I failed.</p><p>because the implementation is written in assembly language,</p><p>the low-level detailed code would soon exceed the complexity</p><p>that a normal people like me can manage.</p></li>

<li><p>I steped back.</p><p>I decided to write a prototype language in scheme.</p><p>the prototype only limited to demonstrate the main idea of "sequent-calculus as type system".</p><p>thus I wrote "sequent1".</p></li></ul>
</div>
</div>

<div id="outline-container-orgc4824e1" class="outline-3">
<h3 id="orgc4824e1">related works</h3>
<div class="outline-text-3" id="text-orgc4824e1">
<ul class="org-ul">
<li><p><p></p><p>there are many other works</p><p>that assign computational models to sequent-calculus-like logics.</p><p>for example :</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">people</th></p><p><th scope="col" class="org-left">logic</th></p><p><th scope="col" class="org-left">model</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">Frank Pfenning</td></p><p><td class="org-left">linear logic</td></p><p><td class="org-left">concurrent programming</td></p><p></tr></p><p></tbody></p><p></table></p></li>

<li><p>maybe one logic system can correspond to multiple computational models.</p><p>maybe more terminologys should be carefully coined,</p><p>and more general framework theory should be wisely designed,</p><p>to describe correspondences between deduction systems and computational models.</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org2385a5c" class="outline-2">
<h2 id="org2385a5c">the change of syntax</h2>
<div class="outline-text-2" id="text-org2385a5c">
<ul class="org-ul">
<li><p>I will introduce my syntax by comparing it with</p><p>the syntax of an imaginary agda-like (or idris-like) language.</p><p>I will mark its syntax by &lt;&lt; application-language &gt;&gt;,</p><p>and I will mark my syntax by &lt;&lt; composition-language &gt;&gt;.</p></li></ul>
</div>
