output/function-compose-type-cut.org
*** natural number

    - << application-language >>
      #+begin_src idris
      data natural : type where
        zero : natural
        succ : natural -> natural

      add : natural -> natural -> natural
      add zero n = n
      add (succ m) n = succ (add m n)

      mul : natural -> natural -> natural
      mul zero n = zero
      mul (succ m) n = add n (mul m n)
      #+end_src

    - note that,
      in the following examples
      "~" can be read as "define-function",
      "+" can be read as "define-type".

    - << composition-language >>
      #+begin_src scheme
      (+ natural (-> type)
         zero (-> natural)
         succ (natural -> natural))

      (~ add (natural natural -> natural)
         (:m zero -> :m)
         (:m :n succ -> :m :n add succ))

      (~ mul (natural natural -> natural)
         (:m zero -> zero)
         (:m :n succ -> :m :n mul :m add))
      #+end_src

*** detailed explanation of above example

    - explanation
      #+begin_src scheme
      (note
        the second arrow of the function body of
        (~ mul (natural natural -> natural)
           (:m zero -> zero)
           (:m :n succ -> :m :n mul :m add))
        which is
        (:m :n succ -> :m :n mul :m add)
        (note
          the antecedent of (:m :n succ -> :m :n mul :m add)
          is (:m :n succ)
          it can be viewed as 3 functions composed together
          the type of each of them are showed by the following list
          ((:m (-> natural))
           (:n (-> natural))
           (succ (natural -> natural)))
          the resulting type is
          (-> natural natural))
        (note
          the succedent of (:m :n succ -> :m :n mul :m add)
          is (:m :n mul :m add)
          it can be viewed as 4 functions composed together
          the type of each of them are showed by the following list
          ((:m (-> natural))
           (:n (-> natural))
           (mul (natural natural -> natural))
           (:m (-> natural))
           (add (natural natural -> natural)))
          the resulting type is
          (-> natural)))
      #+end_src

*** currying must also be explicit

    - in type, input arguments and return values are made explicit.
      instead of (natural -> natural -> natural),
      we write (natural natural -> natural).

    - thus, in function body, currying must also be explicit.
      we lost the implicit syntax for currying.
      because currying is designed as a convention
      for the syntax of function application.

