output/function-compose-type-cut.html

<div id="outline-container-org791f858" class="outline-3">
<h3 id="org791f858">natural number</h3>
<div class="outline-text-3" id="text-org791f858">
<ul class="org-ul">
<li><p><p></p><p>&lt;&lt; application-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-idris"><span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">type</span> <span style="color: #F0DFAF; font-weight: bold;">where</span></p><p>  <span style="color: #DCDCCC; background-color: #3F3F3F;">zero</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span></p><p>  <span style="color: #DCDCCC; background-color: #3F3F3F;">succ</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span></p><p></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">zero</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">succ</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span>) <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">succ</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span>)</p><p></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">mul</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">mul</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">zero</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">zero</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">mul</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">succ</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span>) <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">mul</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span>)</p><p></pre></p><p></div></p></li>

<li><p>note that,</p><p>in the following examples</p><p>"~" can be read as "define-function",</p><p>"+" can be read as "define-type".</p></li>

<li><p><p></p><p>&lt;&lt; composition-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #7CB8BB;">+</span> natural <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">)</span></p><p>   zero <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)</span></p><p>   succ <span style="color: #696969;">(</span>natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> add <span style="color: #696969;">(</span>natural natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> zero <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> add succ<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> mul <span style="color: #696969;">(</span>natural natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> zero <span style="color: #7CB8BB;">-&gt;</span> zero<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-org759e2c0" class="outline-3">
<h3 id="org759e2c0">detailed explanation of above example</h3>
<div class="outline-text-3" id="text-org759e2c0">
<ul class="org-ul">
<li><p><p></p><p>explanation</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">note</span></p><p>  the second arrow of the function body of</p><p>  <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> mul <span style="color: #696969;">(</span>natural natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)</span></p><p>     <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> zero <span style="color: #7CB8BB;">-&gt;</span> zero<span style="color: #696969;">)</span></p><p>     <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">))</span></p><p>  which is</p><p>  <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">)</span></p><p>  <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">note</span></p><p>    the antecedent of <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">)</span></p><p>    is <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ<span style="color: #696969;">)</span></p><p>    it can be viewed as <span style="color: #7CB8BB;">3</span> functions composed together</p><p>    the type of each of them are showed by the following <span style="color: #7CB8BB;">list</span></p><p>    <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span>succ <span style="color: #696969;">(</span>natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)))</span></p><p>    the resulting type is</p><p>    <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural natural<span style="color: #696969;">))</span></p><p>  <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">note</span></p><p>    the succedent of <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">)</span></p><p>    is <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> mul <span style="color: #DCDCCC; font-weight: bold;">:m</span> add<span style="color: #696969;">)</span></p><p>    it can be viewed as <span style="color: #7CB8BB;">4</span> functions composed together</p><p>    the type of each of them are showed by the following <span style="color: #7CB8BB;">list</span></p><p>    <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span>mul <span style="color: #696969;">(</span>natural natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p>     <span style="color: #696969;">(</span>add <span style="color: #696969;">(</span>natural natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)))</span></p><p>    the resulting type is</p><p>    <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-org5cb770b" class="outline-3">
<h3 id="org5cb770b">currying must also be explicit</h3>
<div class="outline-text-3" id="text-org5cb770b">
<ul class="org-ul">
<li><p>in type, input arguments and return values are made explicit.</p><p>instead of (natural -&gt; natural -&gt; natural),</p><p>we write (natural natural -&gt; natural).</p></li>

<li><p>thus, in function body, currying must also be explicit.</p><p>we lost the implicit syntax for currying.</p><p>because currying is designed as a convention</p><p>for the syntax of function application.</p></li></ul>
</div>
</div>
