output/function-compose-type-cut.org
*** vector

    - << application-language >>
      #+begin_src idris
      data vector : natural -> type -> type where
        null : vector zero t
        cons : t -> vector n t -> vector (succ n) t

      append : vector m t -> vector n t -> vector (add m n) t
      append null       l = l
      append (cons e r) l = cons e (append r l)

      map : (m : a -> b) -> f a -> f b
      map f null       = null
      map f (cons e l) = cons (f e) (map f l)
      #+end_src

    - << composition-language >>
      #+begin_src scheme
      (+ vector (natural type -> type)
         null (-> zero :t vector)
         cons (:n :t vector :t -> :n succ :t vector))

      (~ append (:m :t vector :n :t vector -> :m :n add :t vector)
         (:l null -> :l)
         (:l :r :e cons -> :l :r append :e cons))

      (~ map (:n :t1 vector (:t1 -> :t2) -> :n :t2 vector)
         (null :f -> null)
         (:l :e cons :f -> :l :f map :e :f apply cons))
      #+end_src

*** unified syntax

    - the syntax of type and function-body are unified.
      a type is an arrow, a function-body is a list of arrows.

*** different optimization of syntax

***** for function composition

      - << application-language >>
        #+begin_src idris
        compose : {A B C : type} (A -> B) -> (B -> C) -> (A -> C)
        compose f g = λ x -> (f (g x))
        #+end_src

      - << composition-language >>
        the syntax is optimized for function composition.
        function composition is expressed by term concatenation.

***** for function application

      - << application-language >>
        the syntax is optimized for function application.
        function application is expressed by term concatenation.

      - << composition-language >>
        #+begin_src scheme
        (~ apply (:a :b ... (:a :b ... -> :c :d ...) -> :c :d ...)
           (note it is implemented as a primitive-function))
        #+end_src

