output/function-compose-type-cut.html

<div id="outline-container-orgb96c2b9" class="outline-3">
<h3 id="orgb96c2b9">vector</h3>
<div class="outline-text-3" id="text-orgb96c2b9">
<ul class="org-ul">
<li><p><p></p><p>&lt;&lt; application-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-idris"><span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">natural</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">type</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">type</span> <span style="color: #F0DFAF; font-weight: bold;">where</span></p><p>  <span style="color: #DCDCCC; background-color: #3F3F3F;">null</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">zero</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span></p><p>  <span style="color: #DCDCCC; background-color: #3F3F3F;">cons</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">succ</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span>) <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span></p><p></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">append</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">vector</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">add</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">m</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">n</span>) <span style="color: #DCDCCC; background-color: #3F3F3F;">t</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">append</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">null</span>       <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">append</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">cons</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">e</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">r</span>) <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">cons</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">e</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">append</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">r</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span>)</p><p></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">map</span> <span style="color: #DFAF8F;">:</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">m</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">a</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">b</span>) <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">a</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">b</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">map</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">null</span>       <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">null</span></p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">map</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">cons</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">e</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span>) <span style="color: #DFAF8F;">=</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">cons</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">e</span>) (<span style="color: #DCDCCC; background-color: #3F3F3F;">map</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">l</span>)</p><p></pre></p><p></div></p></li>

<li><p><p></p><p>&lt;&lt; composition-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #7CB8BB;">+</span> vector <span style="color: #696969;">(</span>natural type <span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">)</span></p><p>   null <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> zero <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector<span style="color: #696969;">)</span></p><p>   cons <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector <span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> append <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector <span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:m</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> add <span style="color: #DCDCCC; font-weight: bold;">:t</span> vector<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> null <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:r</span> <span style="color: #DCDCCC; font-weight: bold;">:e</span> cons <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:r</span> append <span style="color: #DCDCCC; font-weight: bold;">:e</span> cons<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> map <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #DCDCCC; font-weight: bold;">:t1</span> vector <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> vector<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span>null <span style="color: #DCDCCC; font-weight: bold;">:f</span> <span style="color: #7CB8BB;">-&gt;</span> null<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:e</span> cons <span style="color: #DCDCCC; font-weight: bold;">:f</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:f</span> map <span style="color: #DCDCCC; font-weight: bold;">:e</span> <span style="color: #DCDCCC; font-weight: bold;">:f</span> apply cons<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-orge3dae9e" class="outline-3">
<h3 id="orge3dae9e">unified syntax</h3>
<div class="outline-text-3" id="text-orge3dae9e">
<ul class="org-ul">
<li><p>the syntax of type and function-body are unified.</p><p>a type is an arrow, a function-body is a list of arrows.</p></li></ul>
</div>
</div>

<div id="outline-container-orge3e7a49" class="outline-3">
<h3 id="orge3e7a49">different optimization of syntax</h3>
<div class="outline-text-3" id="text-orge3e7a49">
</div><div id="outline-container-orge2a3610" class="outline-4">
<h4 id="orge2a3610">for function composition</h4>
<div class="outline-text-4" id="text-orge2a3610">
<ul class="org-ul">
<li><p><p></p><p>&lt;&lt; application-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-idris"><span style="color: #DCDCCC; background-color: #3F3F3F;">compose</span> <span style="color: #DFAF8F;">:</span> {<span style="color: #DCDCCC; background-color: #3F3F3F;">A</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">B</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">C</span> <span style="color: #DFAF8F;">:</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">type</span>} (<span style="color: #DCDCCC; background-color: #3F3F3F;">A</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">B</span>) <span style="color: #DFAF8F;">-&gt;</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">B</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">C</span>) <span style="color: #DFAF8F;">-&gt;</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">A</span> <span style="color: #DFAF8F;">-&gt;</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">C</span>)</p><p><span style="color: #DCDCCC; background-color: #3F3F3F;">compose</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">g</span> <span style="color: #DFAF8F;">=</span> &#955; <span style="color: #DCDCCC; background-color: #3F3F3F;">x</span> <span style="color: #DFAF8F;">-&gt;</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">f</span> (<span style="color: #DCDCCC; background-color: #3F3F3F;">g</span> <span style="color: #DCDCCC; background-color: #3F3F3F;">x</span>))</p><p></pre></p><p></div></p></li>

<li><p>&lt;&lt; composition-language &gt;&gt;</p><p>the syntax is optimized for function composition.</p><p>function composition is expressed by term concatenation.</p></li></ul>
</div>
</div>

<div id="outline-container-org8320851" class="outline-4">
<h4 id="org8320851">for function application</h4>
<div class="outline-text-4" id="text-org8320851">
<ul class="org-ul">
<li><p>&lt;&lt; application-language &gt;&gt;</p><p>the syntax is optimized for function application.</p><p>function application is expressed by term concatenation.</p></li>

<li><p><p></p><p>&lt;&lt; composition-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> apply <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span> ... <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span> ... <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span> ...<span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span> ...<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">note</span> it is implemented as a primitive-function<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>
</div>
