output/function-compose-type-cut.org
*** stack processing

    - multiple return values are easily handled,
      and stack-processing functions can be used to help to
      re-order return values (without naming them) for function composition.
      (just like in forth & joy)

    - << composition-language >>
      #+begin_src scheme
      (~ drop (:t ->)
         (:d ->))

      (~ dup (:t -> :t :t)
         (:d -> :d :d))

      (~ over (:t1 :t2 -> :t1 :t2 :t1)
         (:d1 :d2 -> :d1 :d2 :d1))

      (~ tuck (:t1 :t2 -> :t2 :t1 :t2)
         (:d1 :d2 -> :d2 :d1 :d2))

      (~ swap (:t1 :t2 -> :t2 :t1)
         (:d1 :d2 -> :d2 :d1))
      #+end_src

* the correspondence

  - to show Curry–Howard correspondence under this syntax
    is to show,
    1. how to view type as theorem ?
    2. how to view function as proof ?

*** type as theorem

    - with the ability to handle multiple return values,
      we can express "and" easily.
      #+begin_src scheme
      (A B -> C D) -- "(A and B) implies (C and D)"
      #+end_src
      we can express "for all" and "there exist" in an unified way.
      #+begin_src scheme
      ((:x : A) -> :x P) -- "for all x belong to A, we have P(x)"
      (-> (:x : A) :x P) -- "there exist x belong to A, such that P(x)"
      #+end_src

    - I call expression of form (A B C ... -> E F G ...) sequent.
      but you should note that,
      sequent for us, is not exactly the same as sequent for Gentzen.
      Gentzen views succedent as "or", while we view succedent as "and".
      #+begin_src scheme
      for Gentzen -- (A B -> C D) -- "(A and B) implies (C or D)",
      for us      -- (A B -> C D) -- "(A and B) implies (C and D)".
      #+end_src

*** function as proof

    - "function as proof" means,
      the way we write function body forms a language to record deduction.
      a record of many steps of deduction is called a proof.

    - let us summarize deductive rules in sequent calculus in our language.
      I will omit some explicit contexts variables in the deductive rules,
      because in our language contexts can be implicit.

***** cut

      - cut
        #+begin_src scheme
        f : (A -> B)
        g : (B -> C)
        --------------
        f g : (A -> C)
        #+end_src

***** structural

      - left-weakening
        #+begin_src scheme
        f : (A -> C)
        -------------------
        drop f : (A B -> C)
        #+end_src

      - left-contraction
        #+begin_src scheme
        f : (A A -> B)
        ----------------
        dup f : (A -> B)
        #+end_src

      - right-contraction
        #+begin_src scheme
        f : (A -> B B)
        -----------------
        f drop : (A -> B)
        #+end_src

      - left-permutation
        #+begin_src scheme
        f : (A B -> C)
        -------------------
        swap f : (B A -> C)
        #+end_src

      - right-permutation
        #+begin_src scheme
        f : (A -> B C)
        -------------------
        f swap : (A -> C B)
        #+end_src

