output/function-compose-type-cut.html

<div id="outline-container-org17542b2" class="outline-3">
<h3 id="org17542b2">stack processing</h3>
<div class="outline-text-3" id="text-org17542b2">
<ul class="org-ul">
<li><p>multiple return values are easily handled,</p><p>and stack-processing functions can be used to help to</p><p>re-order return values (without naming them) for function composition.</p><p>(just like in forth &amp; joy)</p></li>

<li><p><p></p><p>&lt;&lt; composition-language &gt;&gt;</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> drop <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">-&gt;</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:d</span> <span style="color: #7CB8BB;">-&gt;</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> dup <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:d</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> over <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #DCDCCC; font-weight: bold;">:t1</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:d1</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d1</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #DCDCCC; font-weight: bold;">:d1</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> tuck <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:d1</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #DCDCCC; font-weight: bold;">:d1</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> swap <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #DCDCCC; font-weight: bold;">:t1</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:d1</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d2</span> <span style="color: #DCDCCC; font-weight: bold;">:d1</span><span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org80b0ede" class="outline-2">
<h2 id="org80b0ede">the correspondence</h2>
<div class="outline-text-2" id="text-org80b0ede">
<ul class="org-ul">
<li><p>to show Curry–Howard correspondence under this syntax</p><p>is to show,</p><p><ol class="org-ol"></p><p><li>how to view type as theorem ?</li></p><p><li>how to view function as proof ?</li></ol></p></li></ul>
</div>

<div id="outline-container-orgb9685d1" class="outline-3">
<h3 id="orgb9685d1">type as theorem</h3>
<div class="outline-text-3" id="text-orgb9685d1">
<ul class="org-ul">
<li><p><p></p><p>with the ability to handle multiple return values,</p><p>we can express "and" easily.</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span>A B <span style="color: #7CB8BB;">-&gt;</span> C D<span style="color: #696969;">)</span> -- <span style="color: #CC9393;">"(A and B) implies (C and D)"</span></p><p></pre></p><p></div></p><p><p></p><p>we can express "for all" and "there exist" in an unified way.</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:x</span><span style="color: #FFA23D;"> : </span>A<span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> P<span style="color: #696969;">)</span> -- <span style="color: #CC9393;">"for all x belong to A, we have P(x)"</span></p><p><span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span><span style="color: #FFA23D;"> : </span>A<span style="color: #696969;">)</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> P<span style="color: #696969;">)</span> -- <span style="color: #CC9393;">"there exist x belong to A, such that P(x)"</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>I call expression of form (A B C &#x2026; -&gt; E F G &#x2026;) sequent.</p><p>but you should note that,</p><p>sequent for us, is not exactly the same as sequent for Gentzen.</p><p>Gentzen views succedent as "or", while we view succedent as "and".</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">for Gentzen -- <span style="color: #696969;">(</span>A B <span style="color: #7CB8BB;">-&gt;</span> C D<span style="color: #696969;">)</span> -- <span style="color: #CC9393;">"(A and B) implies (C or D)"</span>,</p><p>for us      -- <span style="color: #696969;">(</span>A B <span style="color: #7CB8BB;">-&gt;</span> C D<span style="color: #696969;">)</span> -- <span style="color: #CC9393;">"(A and B) implies (C and D)"</span>.</p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-org69411eb" class="outline-3">
<h3 id="org69411eb">function as proof</h3>
<div class="outline-text-3" id="text-org69411eb">
<ul class="org-ul">
<li><p>"function as proof" means,</p><p>the way we write function body forms a language to record deduction.</p><p>a record of many steps of deduction is called a proof.</p></li>

<li><p>let us summarize deductive rules in sequent calculus in our language.</p><p>I will omit some explicit contexts variables in the deductive rules,</p><p>because in our language contexts can be implicit.</p></li></ul>
</div>

<div id="outline-container-org44e2096" class="outline-4">
<h4 id="org44e2096">cut</h4>
<div class="outline-text-4" id="text-org44e2096">
<ul class="org-ul">
<li><p><p></p><p>cut</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">)</span></p><p>g<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>B <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p>--------------</p><p>f g<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-org83085ba" class="outline-4">
<h4 id="org83085ba">structural</h4>
<div class="outline-text-4" id="text-org83085ba">
<ul class="org-ul">
<li><p><p></p><p>left-weakening</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p>-------------------</p><p>drop f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A B <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>left-contraction</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">)</span></p><p>----------------</p><p>dup f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>right-contraction</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B B<span style="color: #696969;">)</span></p><p>-----------------</p><p>f drop<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>left-permutation</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A B <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p>-------------------</p><p>swap f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>B A <span style="color: #7CB8BB;">-&gt;</span> C<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>right-permutation</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B C<span style="color: #696969;">)</span></p><p>-------------------</p><p>f swap<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> C B<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>
