output/function-compose-type-cut.org
*** examples

    - have-equal-human-rights
      - in the following example
        "*" can be read as "define-hypothesis"
      #+begin_src scheme
      (* rich-human (:x is-rich -> :x is-human))
      (* poor-human (:x is-poor -> :x is-human))
      (* human-have-equal-human-rights
         (:x is-human :y is-human -> :x :y have-equal-human-rights))

      (~ rich-and-poor-have-equal-human-rights
         (:x is-rich :y is-poor -> :x :y have-equal-human-rights)
         (:ri :po -> :ri rich-human
                     :po poor-human
                     human-have-equal-human-rights))
      #+end_src

    - map/has-length
      #+begin_src scheme
      (+ list (type -> type)
         null (-> :t list)
         cons (:t list :t -> :t list))

      (~ map (:t1 list (:t1 -> :t2) -> :t2 list)
         (null :f -> null)
         (:l :e cons :f -> :l :f map :e :f apply cons))

      (+ has-length (:t list natural -> type)
         null/has-length (-> null zero has-length)
         cons/has-length (:l :n has-length -> :l :a cons :n succ has-length))

      (~ map/has-length (:l :n has-length -> :l :f map :n has-length)
         (null/has-length -> null/has-length)
         (:h cons/has-length -> :h map/has-length cons/has-length))
      #+end_src

    - natural-induction
      #+begin_src scheme
      (+ natural (-> type)
         zero (-> natural)
         succ (natural -> natural))

      (~ natural-induction
         ((:p : (natural -> type))
          zero :p apply
          ((:k : natural) :k :p apply -> :k succ :p apply)
          (:x : natural) -> :x :p apply)
         (:q :q/z :q/s zero -> :q/z)
         (:q :q/z :q/s :n succ ->
             :n
             :q :q/z :q/s :n natural-induction
             :q/s apply))
      #+end_src

* algebra of logic

  - a concrete (not abstract) algebraic structure is rich when
    1. its elements have practical meaning.
    2. it is equipped with many algebraic laws,
       which you can use to transform equations.

  - a good example of such rich concrete algebraic structure
    is the field of multivariate rational function
    (i.e. quotient (or fraction) of multivariate polynomials),
    which is studied in algebraic geometry.

  - since function composition already satisfies associative law,
    we have the opportunity to demonstrate an rich algebraic structure,
    the elements of which are formal theorems.

  - we will try to define those algebraic operations that are closed in the set of derivable theorems.
    hopefully we will be able to capture all deductions by algebraic operations.

*** to mimic fraction of natural number

    - let us view theorem (A -> B) as fraction,
      A as denominator,
      B as numerator.
      - just like (A \ B).
        note that,
        we are using reverse-slash instead of slash,
        to maintain the order of A B in (A -> B).

