output/function-compose-type-cut.html

<div id="outline-container-orgc9ef120" class="outline-3">
<h3 id="orgc9ef120">examples</h3>
<div class="outline-text-3" id="text-orgc9ef120">
<ul class="org-ul">
<li><p><p></p><p>have-equal-human-rights</p><p></p></p><p><ul class="org-ul"></p><p><li><p>in the following example</p><p>"*" can be read as "define-hypothesis"</p></li></ul></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> rich-human <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> is-rich <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> is-human<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> poor-human <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> is-poor <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> is-human<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> human-have-equal-human-rights</p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> is-human <span style="color: #DCDCCC; font-weight: bold;">:y</span> is-human <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> have-equal-human-rights<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> rich-and-poor-have-equal-human-rights</p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> is-rich <span style="color: #DCDCCC; font-weight: bold;">:y</span> is-poor <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> have-equal-human-rights<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:ri</span> <span style="color: #DCDCCC; font-weight: bold;">:po</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:ri</span> rich-human</p><p>               <span style="color: #DCDCCC; font-weight: bold;">:po</span> poor-human</p><p>               human-have-equal-human-rights<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>map/has-length</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #7CB8BB;">+</span> <span style="color: #7CB8BB;">list</span> <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">)</span></p><p>   null <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">list</span><span style="color: #696969;">)</span></p><p>   cons <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">list</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">list</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> map <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #7CB8BB;">list</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t1</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:t2</span> <span style="color: #7CB8BB;">list</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span>null <span style="color: #DCDCCC; font-weight: bold;">:f</span> <span style="color: #7CB8BB;">-&gt;</span> null<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:e</span> cons <span style="color: #DCDCCC; font-weight: bold;">:f</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:f</span> map <span style="color: #DCDCCC; font-weight: bold;">:e</span> <span style="color: #DCDCCC; font-weight: bold;">:f</span> apply cons<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #7CB8BB;">+</span> has-length <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:t</span> <span style="color: #7CB8BB;">list</span> natural <span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">)</span></p><p>   null/has-length <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> null zero has-length<span style="color: #696969;">)</span></p><p>   cons/has-length <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> has-length <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:a</span> cons <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ has-length<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> map/has-length <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> has-length <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:l</span> <span style="color: #DCDCCC; font-weight: bold;">:f</span> map <span style="color: #DCDCCC; font-weight: bold;">:n</span> has-length<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span>null/has-length <span style="color: #7CB8BB;">-&gt;</span> null/has-length<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:h</span> cons/has-length <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:h</span> map/has-length cons/has-length<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li>

<li><p><p></p><p>natural-induction</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #7CB8BB;">+</span> natural <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">)</span></p><p>   zero <span style="color: #696969;">(</span><span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">)</span></p><p>   succ <span style="color: #696969;">(</span>natural <span style="color: #7CB8BB;">-&gt;</span> natural<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> natural-induction</p><p>   <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:p</span><span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>natural <span style="color: #7CB8BB;">-&gt;</span> type<span style="color: #696969;">))</span></p><p>    zero <span style="color: #DCDCCC; font-weight: bold;">:p</span> apply</p><p>    <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:k</span><span style="color: #FFA23D;"> : </span>natural<span style="color: #696969;">)</span> <span style="color: #DCDCCC; font-weight: bold;">:k</span> <span style="color: #DCDCCC; font-weight: bold;">:p</span> apply <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:k</span> succ <span style="color: #DCDCCC; font-weight: bold;">:p</span> apply<span style="color: #696969;">)</span></p><p>    <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span><span style="color: #FFA23D;"> : </span>natural<span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:p</span> apply<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:q</span> <span style="color: #DCDCCC; font-weight: bold;">:q/z</span> <span style="color: #DCDCCC; font-weight: bold;">:q/s</span> zero <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:q/z</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:q</span> <span style="color: #DCDCCC; font-weight: bold;">:q/z</span> <span style="color: #DCDCCC; font-weight: bold;">:q/s</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> succ <span style="color: #7CB8BB;">-&gt;</span></p><p>       <span style="color: #DCDCCC; font-weight: bold;">:n</span></p><p>       <span style="color: #DCDCCC; font-weight: bold;">:q</span> <span style="color: #DCDCCC; font-weight: bold;">:q/z</span> <span style="color: #DCDCCC; font-weight: bold;">:q/s</span> <span style="color: #DCDCCC; font-weight: bold;">:n</span> natural-induction</p><p>       <span style="color: #DCDCCC; font-weight: bold;">:q/s</span> apply<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org2462815" class="outline-2">
<h2 id="org2462815">algebra of logic</h2>
<div class="outline-text-2" id="text-org2462815">
<ul class="org-ul">
<li><p>a concrete (not abstract) algebraic structure is rich when</p><p><ol class="org-ol"></p><p><li>its elements have practical meaning.</li></p><p><li>it is equipped with many algebraic laws,</p><p>which you can use to transform equations.</li></ol></p></li>

<li><p>a good example of such rich concrete algebraic structure</p><p>is the field of multivariate rational function</p><p>(i.e. quotient (or fraction) of multivariate polynomials),</p><p>which is studied in algebraic geometry.</p></li>

<li><p>since function composition already satisfies associative law,</p><p>we have the opportunity to demonstrate an rich algebraic structure,</p><p>the elements of which are formal theorems.</p></li>

<li><p>we will try to define those algebraic operations that are closed in the set of derivable theorems.</p><p>hopefully we will be able to capture all deductions by algebraic operations.</p></li></ul>
</div>

<div id="outline-container-org8cb2615" class="outline-3">
<h3 id="org8cb2615">to mimic fraction of natural number</h3>
<div class="outline-text-3" id="text-org8cb2615">
<ul class="org-ul">
<li><p>let us view theorem (A -&gt; B) as fraction,</p><p>A as denominator,</p><p>B as numerator.</p><p><ul class="org-ul"></p><p><li><p>just like (A \ B).</p><p>note that,</p><p>we are using reverse-slash instead of slash,</p><p>to maintain the order of A B in (A -&gt; B).</p></li></ul></p></li></ul>
</div>
</div>
