output/function-compose-type-cut.org
*** multiplication

    - to multiply two theorems (A -> B) and (C -> D),
      we get (A C -> B D).
      - just like (A \ B) (C \ D) = (A C \ B D).

      #+begin_src scheme
      (* r (A -> B))
      (* s (C -> D))

      (~ r/s/mul (A C -> B D)
         (:x :y -> :x r :y s))

      ;; abstract it to a combinator
      (~ general/mul
         ((:a -> :b) (:c -> :d) -> (:a :c -> :b :d))
         (:r :s -> (lambda (:a :c -> :b :d)
                     (:x :y -> :x :r apply :y :s apply))))
      #+end_src

    - theorems under multiplication is an Abelian group.
      identity element is (->).
      inverse of (A -> B) is (B -> A).

*** two definitions of addition

***** first definition

      - this definition recalls the fraction of natural number,
        but it seems not natural when written as function in our language.

      - to add two theorems (A -> B) and (C -> D),
        we get (A B -> (B C or A D)).
        - just like (A \ B) + (C \ D) = (A C \ (B C + A D)).

        #+begin_src scheme
        (* r (A -> B))
        (* s (C -> D))

        (~ r/s/fraction-add (A C -> (B C or A D))
           (:x :y -> :x r :y)
           (:x :y -> :x :y s))

        ;; abstract it to a combinator
        (~ general/fraction-add
           ((:a -> :b) (:c -> :d) -> (:a :c -> (:b :c or :a :d)))
           (:r :s -> (lambda (:a :c -> (:b :c or :a :d))
                       (:x :y -> :x :r apply :y)
                       (:x :y -> :x :y :s apply))))
        #+end_src

      - distributive is just like fraction of natural number,
        because the way we define addition
        is just like the addition of fraction of natural number.

      - theorems under addition is an Abelian semigroup.
        we do not have identity element,
        and we do not have inverse.
        - of course, we can introduce a "zero-theorem"
          (a theorem that we can never prove)
          as the identity element of addition,
          to make our algebraic structure more like fraction of natural number.

      - under this definition of addition,
        one may call the algebraic structure "natural field",
        to recall its similarites between the fraction of natural number.
        - note that,
          other terms like 'semi-field' is ambiguous.
          because it does not inform us
          whether we mean addition is semi or multiplication is semi.

