output/function-compose-type-cut.html

<div id="outline-container-org112c49f" class="outline-3">
<h3 id="org112c49f">multiplication</h3>
<div class="outline-text-3" id="text-org112c49f">
<ul class="org-ul">
<li><p><p></p><p>to multiply two theorems (A -&gt; B) and (C -&gt; D),</p><p>we get (A C -&gt; B D).</p><p></p></p><p><ul class="org-ul"></p><p><li><p>just like (A \ B) (C \ D) = (A C \ B D).</p></li></ul></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> r <span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> s <span style="color: #696969;">(</span>C <span style="color: #7CB8BB;">-&gt;</span> D<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> r/s/mul <span style="color: #696969;">(</span>A C <span style="color: #7CB8BB;">-&gt;</span> B D<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> r <span style="color: #DCDCCC; font-weight: bold;">:y</span> s<span style="color: #696969;">))</span></p><p></p><p><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">abstract it to a combinator</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> general/mul</p><p>   <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">))</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:r</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)</span></p><p>               <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:r</span> apply <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> apply<span style="color: #696969;">))))</span></p><p></pre></p><p></div></p></li>

<li><p>theorems under multiplication is an Abelian group.</p><p>identity element is (-&gt;).</p><p>inverse of (A -&gt; B) is (B -&gt; A).</p></li></ul>
</div>
</div>

<div id="outline-container-org4dd4dee" class="outline-3">
<h3 id="org4dd4dee">two definitions of addition</h3>
<div class="outline-text-3" id="text-org4dd4dee">
</div><div id="outline-container-org206d8cb" class="outline-4">
<h4 id="org206d8cb">first definition</h4>
<div class="outline-text-4" id="text-org206d8cb">
<ul class="org-ul">
<li><p>this definition recalls the fraction of natural number,</p><p>but it seems not natural when written as function in our language.</p></li>

<li><p><p></p><p>to add two theorems (A -&gt; B) and (C -&gt; D),</p><p>we get (A B -&gt; (B C or A D)).</p><p></p></p><p><ul class="org-ul"></p><p><li><p>just like (A \ B) + (C \ D) = (A C \ (B C + A D)).</p></li></ul></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> r <span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> s <span style="color: #696969;">(</span>C <span style="color: #7CB8BB;">-&gt;</span> D<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> r/s/fraction-add <span style="color: #696969;">(</span>A C <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span>B C or A D<span style="color: #696969;">))</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> r <span style="color: #DCDCCC; font-weight: bold;">:y</span><span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> s<span style="color: #696969;">))</span></p><p></p><p><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">abstract it to a combinator</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> general/fraction-add</p><p>   <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:b</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> or <span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)))</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:r</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:b</span> <span style="color: #DCDCCC; font-weight: bold;">:c</span> or <span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">))</span></p><p>               <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:r</span> apply <span style="color: #DCDCCC; font-weight: bold;">:y</span><span style="color: #696969;">)</span></p><p>               <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> apply<span style="color: #696969;">))))</span></p><p></pre></p><p></div></p></li>

<li><p>distributive is just like fraction of natural number,</p><p>because the way we define addition</p><p>is just like the addition of fraction of natural number.</p></li>

<li><p>theorems under addition is an Abelian semigroup.</p><p>we do not have identity element,</p><p>and we do not have inverse.</p><p><ul class="org-ul"></p><p><li><p>of course, we can introduce a "zero-theorem"</p><p>(a theorem that we can never prove)</p><p>as the identity element of addition,</p><p>to make our algebraic structure more like fraction of natural number.</p></li></ul></p></li>

<li><p>under this definition of addition,</p><p>one may call the algebraic structure "natural field",</p><p>to recall its similarites between the fraction of natural number.</p><p><ul class="org-ul"></p><p><li><p>note that,</p><p>other terms like 'semi-field' is ambiguous.</p><p>because it does not inform us</p><p>whether we mean addition is semi or multiplication is semi.</p></li></ul></p></li></ul>
</div>
</div>
