output/function-compose-type-cut.org
***** second definition

      - this definition seems more natural in our language.

      - to add two theorems (A -> B) and (C -> D),
        we get ((A or B) -> (C or D)).

        #+begin_src scheme
        (* r (A -> B))
        (* s (C -> D))

        (~ r/s/mul-like-add ((A or C) -> (B or D))
           (:x {:x : A} -> :x r)
           (:y {:y : C} -> :y s))

        ;; abstract it to a combinator
        (~ general/mul-like-add
           ((:a -> :b) (:c -> :d) -> ((:a or :c) -> (:b or :d)))
           (:r :s -> (lambda ((:a or :c) -> (:b or :d))
                       (:x {:x : :a} -> :x :r apply)
                       (:y {:y : :c} -> :y :s apply))))
        #+end_src

      - distributive also hold under this definition of addition,
        because (-> A (B or C)) is the same as (-> (A B or A C)).

      - theorems under addition is an Abelian semigroup.
        identity element is (->),
        but we do not have inverse.

*** term-lattice, and cut as weaken

    - this is where we must take term-lattice into account.

      | term                   | lattice          |
      |------------------------+------------------|
      | unification (uni)      | meet             |
      | anti-unification (ani) | join             |
      | cover (or match)       | greater-or-equal |

      - note that,
        "equal" can be defined by "greater-or-equal".

    - term-lattice is also called "subsumption lattice" by other authors.
      I call it "term-lattice",
      because I want to make explicit its relation with term-rewriting-system
      (I will address the detail of term-lattice in another paper).

    - if we have (A -> B) and (C -> D),
      we can cut them only when (C cover B).
      for example, when :
      - C = B
      - C = (B or E)
      - C = :x :y P
        B = :x :x P

    - cut can be viewed as an important way to weaken a theorem.
      we can first multiply (A -> B) and (C -> D) to (A C -> B D),
      then weaken it to (A -> D), provides that (C cover B).

    - we can also extend the lattice operations to cedent (antecedent and succedent),
      because cedent is Cartesian product of term.

*** equality of theorem

    - we can define A == B, as (A -> B) and (B -> A).

*** constructiveness

    - in our language, we have the following keywords to do definitions :
      | keyword | read as                                | function-body |
      |---------+----------------------------------------+---------------|
      | "+"     | define-type, define-data               | trivial       |
      | "~"     | proof, define-theorem, define-function | non-trivial   |
      | "*"     | assume, define-hypothesis              | no            |

    - whenever we have function-body, be it trivial or non-trivial,
      we can use it to rewrite data.
      - for example,
        the function-body of "succ" is trivial,
        it rewrites "zero" to "zero succ",
        i.e. merely add a symbol to the data.
        while the function-body of "add" is non-trivial,
        it rewrites "zero succ zero succ" to "zero succ succ".

    - whenever we use "*" to introduce a hypothesis,
      the constructiveness of function is lost,
      although we still can use it to define functions
      and type check the definitions,
      we can not use it to rewrite data.
      (but abstractiveness is gained,
      I will address the detail of the balance
      between constructiveness and abstractiveness in another paper)

*** algebraic extension

    - then defining a new types by "+",
      we provide a type-constructor,
      and a list of data-constructors.

    - by introducing such constructors,
      we are extending our algebraic structure.
      (just like field extension by root of equations)

* implementation

  - I made an attempt to implement a prototype of the language,
    project page at http://xieyuheng.github.io/sequent1

