output/function-compose-type-cut.html

<div id="outline-container-org921523a" class="outline-4">
<h4 id="org921523a">second definition</h4>
<div class="outline-text-4" id="text-org921523a">
<ul class="org-ul">
<li><p>this definition seems more natural in our language.</p></li>

<li><p><p></p><p>to add two theorems (A -&gt; B) and (C -&gt; D),</p><p>we get ((A or B) -&gt; (C or D)).</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> r <span style="color: #696969;">(</span>A <span style="color: #7CB8BB;">-&gt;</span> B<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">*</span> s <span style="color: #696969;">(</span>C <span style="color: #7CB8BB;">-&gt;</span> D<span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> r/s/mul-like-add <span style="color: #696969;">((</span>A or C<span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span>B or D<span style="color: #696969;">))</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #B380A8;">{</span><span style="color: #DCDCCC; font-weight: bold;">:x</span><span style="color: #FFA23D;"> : </span>A<span style="color: #B380A8;">}</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> r<span style="color: #696969;">)</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #B380A8;">{</span><span style="color: #DCDCCC; font-weight: bold;">:y</span><span style="color: #FFA23D;"> : </span>C<span style="color: #B380A8;">}</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> s<span style="color: #696969;">))</span></p><p></p><p><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">abstract it to a combinator</span></p><p><span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">~</span> general/mul-like-add</p><p>   <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:b</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:c</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> or <span style="color: #DCDCCC; font-weight: bold;">:c</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:b</span> or <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">)))</span></p><p>   <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:r</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #696969;">((</span><span style="color: #DCDCCC; font-weight: bold;">:a</span> or <span style="color: #DCDCCC; font-weight: bold;">:c</span><span style="color: #696969;">)</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:b</span> or <span style="color: #DCDCCC; font-weight: bold;">:d</span><span style="color: #696969;">))</span></p><p>               <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #B380A8;">{</span><span style="color: #DCDCCC; font-weight: bold;">:x</span><span style="color: #FFA23D;"> : </span><span style="color: #DCDCCC; font-weight: bold;">:a</span><span style="color: #B380A8;">}</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:x</span> <span style="color: #DCDCCC; font-weight: bold;">:r</span> apply<span style="color: #696969;">)</span></p><p>               <span style="color: #696969;">(</span><span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #B380A8;">{</span><span style="color: #DCDCCC; font-weight: bold;">:y</span><span style="color: #FFA23D;"> : </span><span style="color: #DCDCCC; font-weight: bold;">:c</span><span style="color: #B380A8;">}</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #DCDCCC; font-weight: bold;">:y</span> <span style="color: #DCDCCC; font-weight: bold;">:s</span> apply<span style="color: #696969;">))))</span></p><p></pre></p><p></div></p></li>

<li><p>distributive also hold under this definition of addition,</p><p>because (-&gt; A (B or C)) is the same as (-&gt; (A B or A C)).</p></li>

<li><p>theorems under addition is an Abelian semigroup.</p><p>identity element is (-&gt;),</p><p>but we do not have inverse.</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgf45d0a9" class="outline-3">
<h3 id="orgf45d0a9">term-lattice, and cut as weaken</h3>
<div class="outline-text-3" id="text-orgf45d0a9">
<ul class="org-ul">
<li><p><p></p><p>this is where we must take term-lattice into account.</p><p></p></p><p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">term</th></p><p><th scope="col" class="org-left">lattice</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">unification (uni)</td></p><p><td class="org-left">meet</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">anti-unification (ani)</td></p><p><td class="org-left">join</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">cover (or match)</td></p><p><td class="org-left">greater-or-equal</td></p><p></tr></p><p></tbody></p><p></table></p><p></p><p><ul class="org-ul"></p><p><li><p>note that,</p><p>"equal" can be defined by "greater-or-equal".</p></li></ul></p></li>

<li><p>term-lattice is also called "subsumption lattice" by other authors.</p><p>I call it "term-lattice",</p><p>because I want to make explicit its relation with term-rewriting-system</p><p>(I will address the detail of term-lattice in another paper).</p></li>

<li><p>if we have (A -&gt; B) and (C -&gt; D),</p><p>we can cut them only when (C cover B).</p><p>for example, when :</p><p><ul class="org-ul"></p><p><li><p>C = B</p></li></p><p><li><p>C = (B or E)</p></li></p><p><li><p>C = :x :y P</p><p>B = :x :x P</p></li></ul></p></li>

<li><p>cut can be viewed as an important way to weaken a theorem.</p><p>we can first multiply (A -&gt; B) and (C -&gt; D) to (A C -&gt; B D),</p><p>then weaken it to (A -&gt; D), provides that (C cover B).</p></li>

<li><p>we can also extend the lattice operations to cedent (antecedent and succedent),</p><p>because cedent is Cartesian product of term.</p></li></ul>
</div>
</div>

<div id="outline-container-org89fce19" class="outline-3">
<h3 id="org89fce19">equality of theorem</h3>
<div class="outline-text-3" id="text-org89fce19">
<ul class="org-ul">
<li><p>we can define A == B, as (A -&gt; B) and (B -&gt; A).</p></li></ul>
</div>
</div>

<div id="outline-container-orge34dcc1" class="outline-3">
<h3 id="orge34dcc1">constructiveness</h3>
<div class="outline-text-3" id="text-orge34dcc1">
<ul class="org-ul">
<li><p><p></p><p>in our language, we have the following keywords to do definitions :</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">keyword</th></p><p><th scope="col" class="org-left">read as</th></p><p><th scope="col" class="org-left">function-body</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">"+"</td></p><p><td class="org-left">define-type, define-data</td></p><p><td class="org-left">trivial</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">"~"</td></p><p><td class="org-left">proof, define-theorem, define-function</td></p><p><td class="org-left">non-trivial</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">"*"</td></p><p><td class="org-left">assume, define-hypothesis</td></p><p><td class="org-left">no</td></p><p></tr></p><p></tbody></p><p></table></p></li>

<li><p>whenever we have function-body, be it trivial or non-trivial,</p><p>we can use it to rewrite data.</p><p><ul class="org-ul"></p><p><li><p>for example,</p><p>the function-body of "succ" is trivial,</p><p>it rewrites "zero" to "zero succ",</p><p>i.e. merely add a symbol to the data.</p><p>while the function-body of "add" is non-trivial,</p><p>it rewrites "zero succ zero succ" to "zero succ succ".</p></li></ul></p></li>

<li><p>whenever we use "*" to introduce a hypothesis,</p><p>the constructiveness of function is lost,</p><p>although we still can use it to define functions</p><p>and type check the definitions,</p><p>we can not use it to rewrite data.</p><p>(but abstractiveness is gained,</p><p>I will address the detail of the balance</p><p>between constructiveness and abstractiveness in another paper)</p></li></ul>
</div>
</div>

<div id="outline-container-orgbcf1259" class="outline-3">
<h3 id="orgbcf1259">algebraic extension</h3>
<div class="outline-text-3" id="text-orgbcf1259">
<ul class="org-ul">
<li><p>then defining a new types by "+",</p><p>we provide a type-constructor,</p><p>and a list of data-constructors.</p></li>

<li><p>by introducing such constructors,</p><p>we are extending our algebraic structure.</p><p>(just like field extension by root of equations)</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgb43053b" class="outline-2">
<h2 id="orgb43053b">implementation</h2>
<div class="outline-text-2" id="text-orgb43053b">
<ul class="org-ul">
<li><p>I made an attempt to implement a prototype of the language,</p><p>project page at <a href="http://xieyuheng.github.io/sequent1">http://xieyuheng.github.io/sequent1</a></p></li></ul>
</div>
