output/function-compose-type-cut.org
*** implementation-tech

    - during writing the prototype language,
      I noticed the language is not necessarily stack-based.
      and we have the following relations :

      | implementation-tech     | the natural of language       |
      |-------------------------+-------------------------------|
      | stack-based computation | call-by-value (non-lazy-eval) |
      | term-rewriting-system   | call-by-name (lazy-eval)      |
      | graph-rewriting-system  | call-by-need (lazy-eval)      |

    - first few versions of sequent1 is implemented as a stack-based language,
      only later, changed to term-rewriting-system.
      because we have to handle lazy-trunk in the language,
      and in a term-rewriting-system,
      I can handle lazy-trunk in an unified implicit way.

*** mistakes in my implementation

    - (1) I fail to far see that
      the structure of reports, which returned by various checkers,
      must be highly structured data, instead of string.
      thus, I fail to print useful reports when checkers find mistakes in code.

    - (2) I know graph-rewriting-system is needed,
      but I did not implement the language by it.
      because I want to keep the prototype simple.

    - (3) can not handle mutual recursive function.

    - (4) can not handle un-named "or".

    - (5) the meaning of equality is not fully understood.

    - (6) not yet designed a good mechanism for abstractiveness.

    - I will correct these mistakes in next versions of the prototype.

* further work

  - (1) I planed to do develop the algebra of logic further.

  - (2) I know that with carefully handled "equality",
    I will be able to use the language as a concrete tool
    to investigate algebraic topology.

* appendixes

*** rationale of using postfix notation

    - in the linear writing system of our language,
      we can roughly distinguish four kinds of notations for function or predicate :
      | infix     | ((1 + 2) + 3) |
      | prefix    | + + 1 2 3     |
      | postfix   | 3 2 1 + +     |
      | borderfix | (+ 1 2 3)     |
      - infix is especially good for associative binary function.
      - prefix and postfix are not ambiguous without bracket.
      - borderfix can be used for functions
        that can apply to different numbers of arguments.

    - my choice is between prefix and postfix,
      because for simplicity I need the following two features :
      - the arity of all functions must be fixed
      - we want our expressions to be not ambiguous without bracket

    - then, how do I decide to use postfix instead of prefix ?
      seemingly, prefix and postfix are symmetric,
      while we still can distinguish them.
      because we write in special order
      (from left to right in most western language).
      - in postfix notation suppose we have written :
        1 2 +
        and we want to add 3 to the result of 1 2 +,
        we simply write :
        1 2 + 3 +
      - while in prefix notation suppose we have written :
        @@html: + 1 2 @@
        and we want to add 3 to the result of + 1 2,
        we have to insert + 3 in front of + 1 2 and write :
        @@html: + 3 + 1 2 @@

    - I summarize the above difference by say :
      postfix notation respect the special order of a linear writing system.
      thus, I use postfix notation.

*** remark on deduction and inference

    - one might ask, what is a deduction or a inference ?
      my answer is,
      a deduction or a inference is a way to express a change of theorem.
      ("a change" means "one step of change")

    - let us generalize it a little bit,
      and to discuss "a change of thing" and "language to record changes".
      you will find these two concepts are very common,
      and they are also named differently in different places :
      | thing   | a change of thing     | language to record changes |
      |---------+-----------------------+----------------------------|
      | theorem | deduction             | proof                      |
      | food    |                       | cookbook                   |
      | data    |                       | algorithm                  |
      | number  | elementary arithmetic |                            |
      (seems to me like a market for language designers)
