output/function-compose-type-cut.html

<div id="outline-container-orga89ab29" class="outline-3">
<h3 id="orga89ab29">implementation-tech</h3>
<div class="outline-text-3" id="text-orga89ab29">
<ul class="org-ul">
<li><p><p></p><p>during writing the prototype language,</p><p>I noticed the language is not necessarily stack-based.</p><p>and we have the following relations :</p><p></p></p><p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">implementation-tech</th></p><p><th scope="col" class="org-left">the natural of language</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">stack-based computation</td></p><p><td class="org-left">call-by-value (non-lazy-eval)</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">term-rewriting-system</td></p><p><td class="org-left">call-by-name (lazy-eval)</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">graph-rewriting-system</td></p><p><td class="org-left">call-by-need (lazy-eval)</td></p><p></tr></p><p></tbody></p><p></table></p></li>

<li><p>first few versions of sequent1 is implemented as a stack-based language,</p><p>only later, changed to term-rewriting-system.</p><p>because we have to handle lazy-trunk in the language,</p><p>and in a term-rewriting-system,</p><p>I can handle lazy-trunk in an unified implicit way.</p></li></ul>
</div>
</div>

<div id="outline-container-orgdadcd03" class="outline-3">
<h3 id="orgdadcd03">mistakes in my implementation</h3>
<div class="outline-text-3" id="text-orgdadcd03">
<ul class="org-ul">
<li><p>(1) I fail to far see that</p><p>the structure of reports, which returned by various checkers,</p><p>must be highly structured data, instead of string.</p><p>thus, I fail to print useful reports when checkers find mistakes in code.</p></li>

<li><p>(2) I know graph-rewriting-system is needed,</p><p>but I did not implement the language by it.</p><p>because I want to keep the prototype simple.</p></li>

<li><p>(3) can not handle mutual recursive function.</p></li>

<li><p>(4) can not handle un-named "or".</p></li>

<li><p>(5) the meaning of equality is not fully understood.</p></li>

<li><p>(6) not yet designed a good mechanism for abstractiveness.</p></li>

<li><p>I will correct these mistakes in next versions of the prototype.</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgc600345" class="outline-2">
<h2 id="orgc600345">further work</h2>
<div class="outline-text-2" id="text-orgc600345">
<ul class="org-ul">
<li><p>(1) I planed to do develop the algebra of logic further.</p></li>

<li><p>(2) I know that with carefully handled "equality",</p><p>I will be able to use the language as a concrete tool</p><p>to investigate algebraic topology.</p></li></ul>
</div>
</div>

<div id="outline-container-org8702566" class="outline-2">
<h2 id="org8702566">appendixes</h2>
<div class="outline-text-2" id="text-org8702566">
</div><div id="outline-container-org8d82aca" class="outline-3">
<h3 id="org8d82aca">rationale of using postfix notation</h3>
<div class="outline-text-3" id="text-org8d82aca">
<ul class="org-ul">
<li><p><p></p><p>in the linear writing system of our language,</p><p>we can roughly distinguish four kinds of notations for function or predicate :</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">infix</td></p><p><td class="org-left">((1 + 2) + 3)</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">prefix</td></p><p><td class="org-left">+ + 1 2 3</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">postfix</td></p><p><td class="org-left">3 2 1 + +</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">borderfix</td></p><p><td class="org-left">(+ 1 2 3)</td></p><p></tr></p><p></tbody></p><p></table></p><p><ul class="org-ul"></p><p><li><p>infix is especially good for associative binary function.</p></li></p><p><li><p>prefix and postfix are not ambiguous without bracket.</p></li></p><p><li><p>borderfix can be used for functions</p><p>that can apply to different numbers of arguments.</p></li></ul></p></li>

<li><p>my choice is between prefix and postfix,</p><p>because for simplicity I need the following two features :</p><p><ul class="org-ul"></p><p><li><p>the arity of all functions must be fixed</p></li></p><p><li><p>we want our expressions to be not ambiguous without bracket</p></li></ul></p></li>

<li><p>then, how do I decide to use postfix instead of prefix ?</p><p>seemingly, prefix and postfix are symmetric,</p><p>while we still can distinguish them.</p><p>because we write in special order</p><p>(from left to right in most western language).</p><p><ul class="org-ul"></p><p><li><p>in postfix notation suppose we have written :</p><p>1 2 +</p><p>and we want to add 3 to the result of 1 2 +,</p><p>we simply write :</p><p>1 2 + 3 +</p></li></p><p><li><p>while in prefix notation suppose we have written :</p><p> + 1 2 </p><p>and we want to add 3 to the result of + 1 2,</p><p>we have to insert + 3 in front of + 1 2 and write :</p><p> + 3 + 1 2</p></li></ul></p></li>

<li><p>I summarize the above difference by say :</p><p>postfix notation respect the special order of a linear writing system.</p><p>thus, I use postfix notation.</p></li></ul>
</div>
</div>

<div id="outline-container-org41ffe51" class="outline-3">
<h3 id="org41ffe51">remark on deduction and inference</h3>
<div class="outline-text-3" id="text-org41ffe51">
<ul class="org-ul">
<li><p>one might ask, what is a deduction or a inference ?</p><p>my answer is,</p><p>a deduction or a inference is a way to express a change of theorem.</p><p>("a change" means "one step of change")</p></li>

<li><p><p></p><p>let us generalize it a little bit,</p><p>and to discuss "a change of thing" and "language to record changes".</p><p>you will find these two concepts are very common,</p><p>and they are also named differently in different places :</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">thing</th></p><p><th scope="col" class="org-left">a change of thing</th></p><p><th scope="col" class="org-left">language to record changes</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">theorem</td></p><p><td class="org-left">deduction</td></p><p><td class="org-left">proof</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">food</td></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">cookbook</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">data</td></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">algorithm</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">number</td></p><p><td class="org-left">elementary arithmetic</td></p><p><td class="org-left">&#xa0;</td></p><p></tr></p><p></tbody></p><p></table></p><p><p></p><p>(seems to me like a market for language designers)</p><p></p></p></li></ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-20 Wed 15:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
